app/controllers/dashboard_controller.rb

    def index
        @variables = Property.find(:all).map { |x| x.owner_name+" - "+x.street_address }#&:owner_name)
---
SELECT `properties`.* FROM `properties` WHERE (`properties`.`owner_name` = 'Vinay') LIMIT 1