app/controllers/properties_controller.rb

  def index
    @properties = Property.paginate(:page => params[:page]).order(sort_column + ' ' + sort_direction)
---
SELECT `properties`.* FROM `properties`

  def show
    @property = Property.find(params[:id])
---
SELECT `properties`.* FROM `properties` WHERE (`properties`.`id` = 1) LIMIT 1

  def edit
    @property = Property.find(params[:id])
---
SELECT `properties`.* FROM `properties` WHERE (`properties`.`id` = 1) LIMIT 1

  def update
    @property = Property.find(params[:id])

    respond_to do |format|
      if @property.update_attributes(params[:property])
---
SELECT `properties`.* FROM `properties` WHERE (`properties`.`id` = 1) LIMIT 1
UPDATE `properties` SET `updated_at` = '2013-11-14 20:12:55', `street_address` = '123 Main Street' WHERE (`properties`.`id` = 1)