app/controllers/recordings_controller.rb

SELECT `recordings`.* FROM `recordings`
---
  def index
    @recordings = Recording.all

SELECT `recordings`.* FROM `recordings` WHERE `recordings`.`id` = 1 LIMIT 1
---
  def show
    @recording = Recording.find(params[:id])

SELECT `recordings`.* FROM `recordings` WHERE `recordings`.`id` = 1 LIMIT 1
---
  def edit
    @recording = Recording.find(params[:id])

INSERT INTO `recordings` (`act_num_id`, `consumption`, `created_at`, `days_in_month`, `name`, `read_date`, `updated_at`, `utility_type_id_id`) VALUES (NULL, NULL, '2013-11-17 02:48:15', NULL, NULL, NULL, '2013-11-17 02:48:15', NULL)
---
  def create
    @recording = Recording.new(params[:recording])

    respond_to do |format|
      if @recording.save

SELECT `recordings`.* FROM `recordings` WHERE `recordings`.`id` = 1 LIMIT 1
UPDATE `recordings` SET `days_in_month` = 29, `name` = 'Vinay', `read_date` = '2013-04-20', `updated_at` = '2013-11-17 06:28:35', `consumption` = '450' WHERE `recordings`.`id` = 1
---
  def update
    @recording = Recording.find(params[:id])

    respond_to do |format|
      if @recording.update_attributes(params[:recording])

SELECT `recordings`.* FROM `recordings` WHERE `recordings`.`id` = 1 LIMIT 1
DELETE FROM `recordings` WHERE `recordings`.`id` = 1
---
  def destroy
    @recording = Recording.find(params[:id])
    @recording.destroy